GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18f24k42.inc
;----- CONFIG4L Options --------------------------------------------------
_BBSIZE_BBSIZE_4096_4L EQU  H'FC'; Boot Block size is 4096 words
_BBSIZE_BBSIZE_2048_4L EQU  H'FD'; Boot Block size is 2048 words
_BBSIZE_BBSIZE_1024_4L EQU  H'FE'; Boot Block size is 1024 words
_BBSIZE_BBSIZE_512_4L EQU  H'FF'; Boot Block size is 512 words

_BBEN_ON_4L          EQU  H'F7'; Boot block enabled
_BBEN_OFF_4L         EQU  H'FF'; Boot block disabled

_SAFEN_ON_4L         EQU  H'EF'; SAF enabled
_SAFEN_OFF_4L        EQU  H'FF'; SAF disabled

_WRTAPP_ON_4L        EQU  H'7F'; Application Block write protected
_WRTAPP_OFF_4L       EQU  H'FF'; Application Block not write protected

;----- CONFIG4H Options --------------------------------------------------
_WRTB_ON_4H          EQU  H'FE'; Configuration registers (300000-30000Bh) write-protected
_WRTB_OFF_4H         EQU  H'FF'; Configuration registers (300000-30000Bh) not write-protected

_WRTC_ON_4H          EQU  H'FD'; Boot Block (000000-0007FFh) write-protected
_WRTC_OFF_4H         EQU  H'FF'; Boot Block (000000-0007FFh) not write-protected

_WRTD_ON_4H          EQU  H'FB'; Data EEPROM write-protected
_WRTD_OFF_4H         EQU  H'FF'; Data EEPROM not write-protected

_WRTSAF_ON_4H        EQU  H'F7'; SAF Write Protected
_WRTSAF_OFF_4H       EQU  H'FF'; SAF not Write Protected

_LVP_OFF_4H          EQU  H'DF'; HV on MCLR/VPP must be used for programming
_LVP_ON_4H           EQU  H'FF'; Low voltage programming enabled. MCLR/VPP pin function is MCLR. MCLRE configuration bit is ignored

;----- CONFIG5L Options --------------------------------------------------
_CP_ON_5L            EQU  H'FE'; PFM and Data EEPROM code protection enabled
_CP_OFF_5L           EQU  H'FF'; PFM and Data EEPROM code protection disabled

;----- CONFIG5H Options --------------------------------------------------

;----- DEVID Equates --------------------------------------------------
_DEVID1          EQU  H'3FFFFE'
_DEVID2          EQU  H'3FFFFF'

;----- IDLOC Equates --------------------------------------------------
_IDLOC0          EQU  H'200000'
_IDLOC1          EQU  H'200001'
_IDLOC2          EQU  H'200002'
_IDLOC3          EQU  H'200003'
_IDLOC4          EQU  H'200004'
_IDLOC5          EQU  H'200005'
_IDLOC6          EQU  H'200006'
_IDLOC7          EQU  H'200007'
_IDLOC8          EQU  H'200008'
_IDLOC9          EQU  H'200009'
_IDLOC10         EQU  H'20000A'
_IDLOC11         EQU  H'20000B'
_IDLOC12         EQU  H'20000C'
_IDLOC13         EQU  H'20000D'
_IDLOC14         EQU  H'20000E'
_IDLOC15         EQU  H'20000F'

        LIST
